Основные_объекты_финиш/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.НашиЦены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Основные_объекты_финиш/src/Documents/УстановкаЦен/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.НашиЦены.Записывать = Истина;
	
	Для Каждого ТекСтрокаЦены Из Цены Цикл
			
			Движение = Движения.НашиЦены.Добавить();
			
			Движение.Период = Дата;
			
			Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
			Движение.Контрагент = Контрагент;
			
			Движение.Цена = ТекСтрокаЦены.Цена;

	КонецЦикла;
	


КонецПроцедуры
